Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: User-installed
fr: Installer par l'utilisateur
ko: 사용자 설치
vi: Người dùng cài đặt
zh_hans: 用户安装
zh_hant: 使用者安裝

source: ALL DATABASES
fr: TOUTES LES BASE DE DONNÉES
ko: 모든 데이터베이스
tr: TÜM VERİTABANLARI
vi: TẤT CẢ CƠ SỞ DỮ LIỆU
zh_hans: 所有数据库
zh_hant: 所有資料庫

source: Allowing is remembered for this client until you revoke it.
fr: L'autorisation est mémorisée pour ce client jusqu'à ce que vous la révoquez.

source: This will permanently delete all query history entries. This action cannot be undone.
fr: Cela supprimera définitivement toutes les entrées de l'historique des requêtes. Cette action ne peut pas être annulée.
ko: 모든 쿼리 기록 항목을 영구적으로 삭제합니다. 이 작업은 실행 취소할 수 없습니다.
tr: Bu işlem tüm sorgu geçmişi kayıtlarını kalıcı olarak siler. Bu işlem geri alınamaz.
vi: Thao tác này sẽ xóa vĩnh viễn toàn bộ lịch sử truy vấn. Không thể hoàn tác.
zh_hans: 此操作将永久删除所有查询历史记录。无法撤销。
zh_hant: 此操作將永久刪除所有查詢歷程記錄項目。此動作無法復原。

# %lld in · %lld out
source: %1$lld in · %2$lld out
fr: %1$lld en · %2$lld sortant
ko: 입력 %1$lld · 출력 %2$lld
tr: %lld giriş · %lld çıkış
vi: %lld vào · %lld ra
zh_hans: %lld 输入 · %lld 输出
zh_hant: %1$lld 輸入 · %2$lld 輸出

source: Filtered, first %@
fr: Filtré, premier %@

source: Confirmed each time.
fr: Confirmé à chaque fois.

source: No Matching Queries
fr: Aucune requête de correspondance
ko: 일치하는 쿼리 없음
tr: Eşleşen Sorgu Yok
vi: Không có truy vấn phù hợp
zh_hans: 无匹配查询
zh_hant: 無符合的查詢

source: This column carries no SRID and its coordinates are outside the range of longitude and latitude, so the map cannot place them.
fr: Cette colonne n'a pas de SRID et ses coordonnées sont en dehors de la plage de longitude et de latitude, donc la carte ne peut pas les placer.

source: Font:
fr: Police :
ko: 글꼴:
tr: Yazı Tipi:
vi: Phông chữ:
zh_hans: 字体:
zh_hant: 字型：

source: Unknown panel(s): %@
fr: Panneau(s) inconnu(x) : %@
ko: 알 수 없는 패널: %@
tr: Bilinmeyen panel(ler): %@
vi: Bảng không xác định: %@
zh_hans: 未知的面板：%@
zh_hant: 未知的面板：%@

source: Change Password…
fr: Changer le mot de passe...
ko: 암호 변경…
tr: Parolayı Değiştir…
vi: Đổi mật khẩu…
zh_hans: 更改密码…
zh_hant: 更改密碼…

source: List tables and views in the active database of a connection.
fr: Liste des tables et des vues dans la base de données active d'une connexion.
ko: 연결의 활성 데이터베이스에 있는 테이블과 뷰를 나열합니다.
tr: Bir bağlantının etkin veritabanındaki tabloları ve görünümleri listeler.
vi: Liệt kê bảng và view trong cơ sở dữ liệu đang hoạt động của một kết nối.
zh_hans: 列出连接当前数据库中的表和视图。
zh_hant: 列出連線目前資料庫中的資料表與檢視表。

source: Reopen Last Session
fr: Réouvrir la dernière session
ko: 마지막 세션 다시 열기
tr: Son Oturumu Yeniden Aç
vi: Mở lại phiên làm việc trước
zh_hans: 重新打开上次会话
zh_hant: 重新開啟上次工作階段

source: Integrations: Running (%d clients)
fr: Intégrations : En cours (%d clients)
ko: 통합: 실행 중(클라이언트 %d개)
tr: Entegrasyonlar: Çalışıyor (%d istemci)
vi: Tích hợp: Đang chạy (%d client)
zh_hans: 集成：运行中（%d 个客户端）
zh_hant: 整合：執行中（%d 個用戶端）

source: %d rules
fr: %d règles

source: Connect to the database before starting this operation.
fr: Connectez-vous à la base de données avant de commencer cette opération.
ko: 이 작업을 시작하기 전에 데이터베이스에 연결하십시오.
tr: Bu işlemi başlatmadan önce veritabanına bağlanın.
vi: Kết nối tới cơ sở dữ liệu trước khi bắt đầu thao tác này.
zh_hans: 开始此操作前请先连接数据库。
zh_hant: 開始此操作前請先連線資料庫。

source: Plugin has active connections
fr: Le plugin a des connexions actives
ko: 플러그인에 활성 연결이 있습니다
tr: Eklentinin etkin bağlantıları var
vi: Plugin đang có kết nối hoạt động
zh_hans: 插件有活跃的连接
zh_hant: 外掛有作用中的連線

source: Higher values create fewer INSERT statements, resulting in smaller files and faster imports
fr: Des valeurs plus élevées créent moins d'instructions INSERT, ce qui entraîne des fichiers plus petits et des importations plus rapides.
ko: 값이 클수록 INSERT 문 수가 줄어들어 파일이 작아지고 가져오기가 빨라집니다
tr: Daha yüksek değerler daha az INSERT ifadesi oluşturur, daha küçük dosyalar ve daha hızlı içe aktarma sağlar
vi: Giá trị cao hơn tạo ít câu lệnh INSERT hơn, giúp tệp nhỏ hơn và nhập nhanh hơn
zh_hans: 值越大，生成的 INSERT 语句越少，文件更小，导入更快
zh_hant: 值越大,產生的 INSERT 陳述式越少,檔案更小且匯入更快

source: Show Next Connection
fr: Afficher la prochaine connexion
ko: 다음 연결 보기
tr: Sonraki Bağlantıyı Göster
vi: Hiện kết nối tiếp theo
zh_hans: 显示下一个连接
zh_hant: 顯示下一個連線

source: Structured data format. Ideal for APIs and web applications.
fr: Format de données structurées. Idéal pour les API et les applications web.
ko: 구조화된 데이터 형식입니다. API와 웹 애플리케이션에 적합합니다.
tr: Yapılandırılmış veri biçimi. API'ler ve web uygulamaları için ideal.
vi: Định dạng dữ liệu có cấu trúc. Lý tưởng cho API và ứng dụng web.
zh_hans: 结构化数据格式。适用于 API 和 Web 应用。
zh_hant: 結構化資料格式。適合用於 API 與網頁應用程式。

source: Optimize table (merge parts)
fr: Optimiser la table (fusionner les parties)
ko: 테이블 최적화(파트 병합)
tr: Tabloyu optimize et (parçaları birleştir)
vi: Tối ưu hoá bảng (hợp nhất phần)
zh_hans: 优化表（合并分区）
zh_hant: 最佳化資料表（合併分割區）

source: Statements
fr: Déclarations

source: Match what I type, otherwise lowercase
fr: Correspondre à ce que j'écris, sinon en minuscules

source: cloud-sql-proxy was not found. Install it with “brew install cloud-sql-proxy”, or download it in the Cloud SQL Auth Proxy settings.
fr: cloud-sql-proxy n'a pas été trouvé. Installez-le avec "brew install cloud-sql-proxy", ou téléchargez-le dans les paramètres Cloud SQL Auth Proxy.
ko: cloud-sql-proxy를 찾을 수 없습니다. “brew install cloud-sql-proxy”로 설치하거나 Cloud SQL Auth Proxy 설정에서 다운로드하십시오.
tr: cloud-sql-proxy bulunamadı. “brew install cloud-sql-proxy” ile yükleyin veya Cloud SQL Auth Proxy ayarlarından indirin.
vi: Không tìm thấy cloud-sql-proxy. Cài bằng “brew install cloud-sql-proxy”, hoặc tải xuống trong cài đặt Cloud SQL Auth Proxy.
zh_hans: 未找到 cloud-sql-proxy。可用 “brew install cloud-sql-proxy” 安装，或在 Cloud SQL Auth Proxy 设置中下载。
zh_hant: 找不到 cloud-sql-proxy。可用 “brew install cloud-sql-proxy” 安裝，或在 Cloud SQL Auth Proxy 設定中下載。

source: AI
fr: IA

source: New password:
fr: Nouvelle mot de passe :
ko: 새 암호:
tr: Yeni parola:
vi: Mật khẩu mới:
zh_hans: 新密码：
zh_hant: 新密碼：

source: %d lines
fr: %d lignes
ko: %d줄
tr: %d satır
vi: %d dòng
zh_hans: %d 行
zh_hant: %d 行

source: optional
fr: facultatif

source: %1$lld of %2$lld %3$@
fr: %1$lld de %2$lld %3$@

source: Update to v%@
fr: Mise à jour vers v%@
ko: 버전 v%@ 업데이트
tr: v%@ sürümüne güncelle
vi: Cập nhật lên v%@
zh_hans: 更新到 v%@
zh_hant: 更新至 v%@

source: Your prompts, schema, and query text reach Anthropic under your consumer plan and its privacy settings, not the API's commercial terms.
fr: Vos invites, votre schéma et votre texte de requête atteignent Anthropic dans le cadre de votre forfait de consommation et de ses paramètres de confidentialité, et non dans le cadre des conditions commerciales de l'API.
ko: 프롬프트, 스키마 및 쿼리 텍스트는 API의 상업용 약관이 아닌 소비자 요금제와 해당 개인정보 보호 설정에 따라 Anthropic으로 전송됩니다.
tr: İstemleriniz, şemanız ve sorgu metniniz Anthropic'e API'nin ticari koşullarıyla değil, tüketici planınız ve onun gizlilik ayarları kapsamında ulaşır.
vi: Câu lệnh, schema và nội dung truy vấn của bạn đến Anthropic theo gói người dùng và các thiết lập riêng tư của gói đó, không phải theo điều khoản thương mại của API.
zh_hans: 你的提示词、Schema 和查询文本按你的消费者套餐及其隐私设置发送到 Anthropic，而不是按 API 的商业条款。
zh_hant: 你的提示詞、綱要和查詢文字會依你的消費者方案及其隱私設定傳送到 Anthropic，而不是依 API 的商業條款。

source: Signs in with a web identity token, which is not supported yet.
fr: Se connecter avec un jeton d'identité web, qui n'est pas encore pris en charge.

source: Integrations: Stopped
fr: Intégrations : Arrêtées
ko: 통합: 중지됨
tr: Entegrasyonlar: Durduruldu
vi: Tích hợp: Đã dừng
zh_hans: 集成：已停止
zh_hant: 整合：已停止

source: Filter logic mode
fr: Mode logique de filtrage
ko: 필터 논리 모드
tr: Filtre mantık modu
vi: Chế độ logic bộ lọc
zh_hans: 筛选逻辑模式
zh_hant: 篩選邏輯模式

source: No SSL encryption
fr: Pas d'encodage SSL
ko: SSL 암호화 없음
tr: SSL şifrelemesi yok
vi: Không mã hóa SSL
zh_hans: 无 SSL 加密
zh_hant: 無 SSL 加密

source: All Connections
fr: Toutes les connexions
ko: 모든 연결
tr: Tüm Bağlantılar
vi: Tất cả kết nối
zh_hans: 所有连接
zh_hant: 所有連線

source: Database the listing covers
fr: Base de données que l'annonce couvre
ko: 목록이 다루는 데이터베이스
tr: Listelemenin kapsadığı veritabanı
vi: Cơ sở dữ liệu mà danh sách bao gồm
zh_hans: 该列表涵盖的数据库
zh_hant: 該清單涵蓋的資料庫

source: greater or equal
fr: Plus grand ou égal
ko: 크거나 같음
tr: büyük veya eşit
vi: lớn hơn hoặc bằng
zh_hans: 大于或等于
zh_hant: 大於或等於

source: The tunnel command has an unclosed quote.
fr: La commande du tunnel a une citation non fermée.

source: Date format:
fr: Format de date :
ko: 날짜 형식:
tr: Tarih biçimi:
vi: Định dạng ngày:
zh_hans: 日期格式:
zh_hant: 日期格式：

source: This Week
fr: Cette semaine
ko: 이번 주
tr: Bu Hafta
vi: Tuần này
zh_hans: 本周
zh_hant: 本週

source: Allow %@ to access TablePro?
fr: Permettre à %@ d'accéder à TablePro ?
ko: %@의 TablePro 접근을 허용하시겠습니까?
tr: %@ uygulamasının TablePro'ya erişmesine izin verilsin mi?
vi: Cho phép %@ truy cập TablePro?
zh_hans: 允许 %@ 访问 TablePro？
zh_hant: 允許 %@ 存取 TablePro？

source: Remove Provider?
fr: Supprimer le fournisseur ?
ko: 제공자를 제거하시겠습니까?
tr: Sağlayıcı Kaldırılsın mı?
vi: Gỡ nhà cung cấp?
zh_hans: 移除提供方？
zh_hant: 移除供應商？

source: API Key
fr: Clé API
ko: API 키
tr: API Anahtarı

source: Ask Each Time
fr: Demandez à chaque fois
ko: 매번 묻기
tr: Her Seferinde Sor
vi: Hỏi mỗi lần
zh_hans: 每次询问
zh_hant: 每次詢問

source: Pro license required for iCloud Sync
fr: Licence Pro requise pour la synchronisation iCloud.
ko: iCloud 동기화에는 Pro 라이선스가 필요합니다
tr: iCloud Eşitlemesi için Pro lisans gereklidir
vi: Cần giấy phép Pro để sử dụng iCloud Sync
zh_hans: iCloud 同步需要 Pro 许可证
zh_hant: iCloud 同步需要 Pro 授權

source: The server fills in %@, so it cannot be given a value.
fr: Le serveur remplit %@, donc il ne peut pas être attribué de valeur.

source: Filter operator
fr: Opérateur de filtre
ko: 필터 연산자
tr: Filtre operatörü
vi: Toán tử lọc
zh_hans: 筛选运算符
zh_hant: 篩選運算子

source: Schema the listing covers
fr: Schéma de la liste couverte
ko: 목록이 다루는 스키마
tr: Listelemenin kapsadığı şema
vi: Schema mà danh sách bao gồm
zh_hans: 该列表涵盖的 Schema
zh_hant: 該清單涵蓋的綱要

source: Max Bytes Billed
fr: Max Bytes facturés
ko: 최대 청구 바이트
tr: Faturalanacak Maks Bayt
vi: Số byte tính phí tối đa
zh_hans: 最大计费字节数
zh_hant: 最大計費位元組數

source: Toggle query history
fr: Activer ou désactiver l'historique
ko: 쿼리 기록 표시/숨기기
vi: Bật/tắt lịch sử truy vấn
zh_hans: 切换查询历史
zh_hant: 切換查詢歷史

source: Query timeout
fr: Délai d'expiration de la requête
ko: 쿼리 제한 시간
tr: Sorgu zaman aşımı
vi: Thời gian chờ truy vấn
zh_hans: 查询超时
zh_hant: 查詢逾時

source: Copy Special
fr: Copie spéciale
ko: 특수 복사
tr: Özel Kopyala
vi: Sao chép đặc biệt
zh_hans: 特殊复制
zh_hant: 特殊複製

source: Choose…
fr: Choisissez...
ko: 선택…
tr: Seç…
vi: Chọn…
zh_hans: 选择…
zh_hant: 選擇…

source: License Removed
fr: Licence supprimée
ko: 라이선스 제거됨
tr: Lisans Kaldırıldı
vi: Giấy phép đã xoá
zh_hans: 许可证已移除
zh_hant: 授權已移除

source: Show All Collections
fr: Afficher toutes les collections
ko: 모든 컬렉션 보기
vi: Hiển thị tất cả Collection
zh_hans: 显示所有集合
zh_hant: 顯示所有集合

source: Delete Word Forward
fr: Supprimer le mot en avant
ko: 다음 단어 삭제
tr: Sonraki Kelimeyi Sil
vi: Xoá từ liền sau
zh_hans: 删除后一个单词
zh_hant: 刪除後一個單字

source: Theme Actions
fr: Actions du thème
ko: 테마 작업
tr: Tema İşlemleri
vi: Thao tác giao diện
zh_hans: 主题操作
zh_hant: 佈景主題操作

source: Database names this connection can reach
fr: Les noms de la base de données à laquelle cette connexion peut accéder
ko: 이 연결이 접근할 수 있는 데이터베이스 이름
tr: Bu bağlantının erişebildiği veritabanı adları
vi: Tên các cơ sở dữ liệu mà kết nối này có thể truy cập
zh_hans: 此连接可以访问的数据库名称
zh_hant: 此連線可以存取的資料庫名稱

source: Display name
fr: Nom d'affichage
ko: 표시 이름
tr: Görünen ad
vi: Tên hiển thị
zh_hans: 显示名称
zh_hant: 顯示名稱

# %d-%d of %@%@ rows
source: %1$d-%2$d of %3$@%4$@ rows
fr: %3$@ %1$d-%2$d de %4$@ lignes
ko: %1$d-%2$d / %3$@%4$@행
tr: %d-%d / %@%@ satır
vi: %d-%d trên %@%@ dòng
zh_hans: %d-%d / %@%@行
zh_hant: %1$d-%2$d / %3$@%4$@ 列

source: Copy Column Values
fr: Copier les valeurs des colonnes
ko: 열 값 복사
tr: Sütun Değerlerini Kopyala
vi: Sao chép giá trị cột
zh_hans: 复制列值
zh_hant: 複製欄位值

source: A statement on '%1$@' matched %2$d rows instead of %3$d.
fr: Une déclaration sur '%1$@' a correspondu à %2$d lignes au lieu de %3$d.
ko: '%1$@'의 명령문이 %3$d개가 아니라 %2$d개 행과 일치했습니다.
tr: '%1$@' üzerindeki bir ifade %3$d yerine %2$d satırla eşleşti.
vi: Một câu lệnh trên '%1$@' khớp %2$d dòng thay vì %3$d.
zh_hans: '%1$@' 上的语句匹配了 %2$d 行而不是 %3$d 行。
zh_hant: '%1$@' 上的陳述式符合 %2$d 列而不是 %3$d 列。

source: Restore into “%@”?
fr: Restaurer en « %@ » ?

source: The index %@ is left out
fr: L'indice %@ est omis.

source: Connect timeout
fr: Délai d'attente de connexion écoul

source: No activations found
fr: Aucune activation trouvée
ko: 활성화를 찾을 수 없음
tr: Etkinleştirme bulunamadı
vi: Không tìm thấy kích hoạt nào
zh_hans: 未找到激活记录
zh_hant: 找不到啟用記錄

source: Exact value
fr: Valeur exacte
ko: 정확한 값
tr: Tam değer
vi: Giá trị chính xác
zh_hans: 精确值
zh_hant: 精確值

source: Statements run on the SSH server, so reads and writes act on the live database. The server needs python3.
fr: Les déclarations s'exécutent sur le serveur SSH, donc les lectures et les écritures agissent sur la base de données en direct. Le serveur nécessite python3.

source: Authentication
fr: Authentification
ko: 인증
tr: Kimlik Doğrulama
vi: Xác thực
zh_hans: 身份验证
zh_hant: 身分驗證

source: Get detailed table structure: columns, indexes, foreign keys, and DDL
fr: Obtenez une structure de table détaillée : colonnes, index, clés étrangères et DDL.
ko: 열, 인덱스, 외래 키 및 DDL을 포함한 상세 테이블 구조 가져오기
tr: Ayrıntılı tablo yapısını al: sütunlar, indeksler, yabancı anahtarlar ve DDL
vi: Lấy cấu trúc bảng chi tiết: cột, index, khóa ngoại và DDL
zh_hans: 获取详细的表结构：列、索引、外键和 DDL
zh_hant: 取得詳細的資料表結構：欄位、索引、外鍵和 DDL

source: -- … %d more characters not shown; use Copy All for the full output.
fr: -- … %d caractères supplémentaires non affichés ; utilisez Copier tout pour la sortie complète.
ko: -- … 나머지 %d자는 표시되지 않음. 전체 출력은 모두 복사를 사용하십시오.
tr: -- … %d karakter daha gösterilmiyor; çıktının tamamı için Tümünü Kopyala'yı kullanın.
vi: -- … còn %d ký tự nữa không hiển thị; dùng Sao chép tất cả để xem toàn bộ kết quả.
zh_hans: -- … 还有%d个字符未显示；使用"全部复制"获取完整输出。
zh_hant: -- … 還有 %d 個字未顯示；請使用「全部複製」取得完整輸出。

source: Optional, for temporary credentials
fr: Facultatif, pour des identifiants temporaires.

source: How many statements to include, 1 to 500. Defaults to 50
fr: Combien d'affirmations inclure, de 1 à 500. Par défaut, c'est 50.
ko: 포함할 명령문 수이며 1에서 500까지입니다. 기본값은 50입니다
tr: Kaç ifadenin dahil edileceği, 1 ile 500 arası. Varsayılan 50
vi: Số câu lệnh cần lấy, từ 1 đến 500. Mặc định là 50
zh_hans: 要包含多少条语句，1 到 500。默认为 50
zh_hant: 要包含多少條陳述式，1 到 500。預設為 50

source: Startup SQL
fr: SQL de démarrage
ko: 시작 SQL
tr: Başlangıç SQL
vi: SQL khởi động
zh_hans: 启动 SQL
zh_hant: 啟動 SQL

source: Find in file
fr: Trouver dans le fichier

source: Import cancelled by user
fr: Importation annulée par l'utilisateur.
ko: 사용자가 가져오기를 취소했습니다
tr: İçe aktarma kullanıcı tarafından iptal edildi
vi: Người dùng đã hủy nhập
zh_hans: 用户已取消导入
zh_hant: 使用者已取消匯入

source: referenced by %@
fr: Référencé par %@

source: Replace in Column…
fr: Remplacer dans la colonne...

source: These rows come from a view, which cannot be edited.
fr: Ces lignes proviennent d'une vue, qui ne peut pas être modifiée.
ko: 이 행들은 편집할 수 없는 뷰에서 왔습니다.
tr: Bu satırlar düzenlenemeyen bir görünümden geliyor.
vi: Các dòng này đến từ một view, vốn không sửa được.
zh_hans: 这些行来自视图，视图不可编辑。
zh_hant: 這些列來自檢視表，檢視表不可編輯。

source: Recently Closed
fr: Récemment fermé
ko: 최근에 닫은 항목
tr: Son Kapatılanlar
vi: Vừa đóng gần đây
zh_hans: 最近关闭
zh_hant: 最近關閉

source: AI Walkthrough
fr: Guide d'utilisation de l'IA
ko: AI 단계별 안내
tr: AI Adım Adım Anlatım
vi: Hướng dẫn AI
zh_hans: AI 分步讲解
zh_hant: AI 逐步解說

source: Export table
fr: Tableau d'exportation
ko: 테이블 내보내기
tr: Tabloyu dışa aktar
vi: Xuất bảng
zh_hans: 导出表
zh_hant: 匯出資料表

source: Object
fr: Objet
ko: 객체
tr: Nesne
vi: Đối tượng
zh_hans: 对象
zh_hant: 物件

source: Period to summarize: today, this_week, this_month, or all
fr: Période à résumer : aujourd'hui, cette semaine, ce mois ou tout le temps.
ko: 요약할 기간입니다: today, this_week, this_month 또는 all
tr: Özetlenecek dönem: today, this_week, this_month veya all
vi: Khoảng thời gian để tổng hợp: today, this_week, this_month hoặc all
zh_hans: 要汇总的时间段：today、this_week、this_month 或 all
zh_hant: 要彙總的時間範圍：today、this_week、this_month 或 all

source: Sign Out
fr: Se déconnecter
ko: 로그아웃
tr: Oturumu Kapat
vi: Đăng xuất
zh_hans: 退出登录
zh_hant: 登出

source: Always Show Filter Bar
fr: Afficher toujours la barre de filtres

source: No query executed yet
fr: Aucune requête n'a encore été exécut
ko: 아직 실행된 쿼리 없음
tr: Henüz sorgu çalıştırılmadı
vi: Chưa thực hiện truy vấn nào
zh_hans: 尚未执行查询
zh_hant: 尚未執行查詢

source: Export Activity Log
fr: Journal d'activité d'exportation
ko: 활동 로그 내보내기
tr: Etkinlik Günlüğünü Dışa Aktar
vi: Xuất nhật ký hoạt động
zh_hans: 导出活动日志
zh_hant: 匯出活動記錄

source: This database cannot create a table from the visual editor.
fr: Cette base de données ne peut pas créer une table à partir de l'éditeur visuel.

source: This action needs a modifier key like ⌘ or ⌥. A plain key won't reach the menu reliably.
fr: Cette action nécessite une touche de modifier comme ⌘ ou ⌥. Une touche normale ne parvient pas à atteindre le menu de manière fiable.
ko: 이 작업에는 ⌘ 또는 ⌥ 같은 보조 키가 필요합니다. 일반 키는 메뉴에 안정적으로 전달되지 않습니다.
tr: Bu işlem ⌘ veya ⌥ gibi bir değiştirici tuş gerektirir. Tek başına bir tuş menüye güvenilir şekilde ulaşmaz.
vi: Hành động này cần phím bổ trợ như ⌘ hoặc ⌥. Phím đơn sẽ không đến được menu một cách ổn định.
zh_hans: 此操作需要 ⌘ 或 ⌥ 等修饰键。单个普通按键无法可靠地触发菜单。
zh_hant: 此操作需要 ⌘ 或 ⌥ 之類的輔助按鍵。單獨的普通按鍵無法可靠地觸發選單。

source: Data
fr: Données
ko: 데이터
tr: Veri
vi: Dữ liệu
zh_hans: 数据
zh_hant: 資料

source: Select a row to see its fields.
fr: Sélectionnez une ligne pour voir ses champs.

source: This value is not one of the type's current labels
fr: Cette valeur n'est pas l'une des étiquettes actuelles du type.
ko: 이 값은 현재 유형 레이블 중 하나가 아닙니다
tr: Bu değer, türün geçerli etiketlerinden biri değil
vi: Giá trị này không nằm trong các nhãn hiện có của kiểu
zh_hans: 此值不在该类型的现有标签中
zh_hant: 此值不在該類型的現有標籤中

source: Bytes Received
fr: Bytes reçus
ko: 수신 바이트
tr: Alınan Bayt
vi: Byte nhận
zh_hans: 接收字节
zh_hant: 接收位元組

source: Skipped settings this server does not recognize: %@.
fr: Paramètres ignorés que ce serveur ne reconnaît pas : %@.
ko: 이 서버가 인식하지 못하는 설정을 건너뛰었습니다: %@.
tr: Bu sunucunun tanımadığı ayarlar atlandı: %@.
vi: Đã bỏ qua các thiết lập mà máy chủ này không nhận ra: %@.
zh_hans: 已跳过此服务器无法识别的设置：%@。
zh_hant: 已略過此伺服器無法辨識的設定：%@。

source: Reload from Disk
fr: Recharger depuis le disque
ko: 디스크에서 다시 로드
tr: Diskten Yeniden Yükle
vi: Tải lại từ đĩa
zh_hans: 从磁盘重新载入
zh_hant: 從磁碟重新載入

source: Commands for the current tab and connection
fr: Commandes pour l'onglet et la connexion actuels

source: Not signed in to Cursor. Sign in first.
fr: Vous n'êtes pas connecté à Cursor. Connectez-vous d'abord.
ko: Cursor에 로그인되지 않았습니다. 먼저 로그인하십시오.
tr: Cursor'a giriş yapılmadı. Önce giriş yapın.
vi: Chưa đăng nhập Cursor. Hãy đăng nhập trước.
zh_hans: 未登录 Cursor。请先登录。
zh_hant: 尚未登入 Cursor。請先登入。

source: Name the %@ to see the statements.
fr: Nommez le %@ pour voir les déclarations.

source: Expose to local network
fr: Exposer à un réseau local
ko: 로컬 네트워크에 공개
tr: Yerel ağa aç
vi: Cho phép truy cập từ mạng cục bộ
zh_hans: 开放给本地网络
zh_hant: 開放給本機網路

source: The connection stopped responding.
fr: La connexion a cessé de répondre.
ko: 연결이 응답을 멈췄습니다.
tr: Bağlantı yanıt vermeyi bıraktı.
vi: Kết nối đã ngừng phản hồi.
zh_hans: 连接已停止响应。
zh_hant: 連線已停止回應。

source: Escape clears the search text
fr: L'évasion efface le texte de recherche.
ko: Escape 키를 누르면 검색 텍스트가 지워집니다
tr: Escape arama metnini temizler
vi: Escape xoá nội dung tìm kiếm
zh_hans: Escape 清除搜索文本
zh_hant: Escape 清除搜尋文字

source: Invalid pattern
fr: Modèle invalide
ko: 잘못된 패턴
tr: Geçersiz desen
vi: Mẫu không hợp lệ
zh_hans: 模式无效
zh_hant: 模式無效

source: Failed to import DDL: %@
fr: Échec de l'importation de DDL : %@
ko: DDL을 가져오지 못했습니다: %@
tr: DDL içe aktarılamadı: %@
vi: Nhập DDL thất bại: %@
zh_hans: 导入 DDL 失败: %@
zh_hant: 匯入 DDL 失敗：%@

source: Connection limit
fr: Limite de connexion
ko: 연결 제한
tr: Bağlantı limiti
vi: Giới hạn kết nối
zh_hans: 连接数限制
zh_hant: 連線數上限

source: Tag: %@
fr: Étiquette : %@
ko: 태그: %@
vi: Thẻ: %@
zh_hans: 标签：%@
zh_hant: 標籤：%@

source: The driver cannot write a new row.
fr: Le conducteur ne peut pas écrire une nouvelle ligne.

source: Drop Partition?
fr: Partition tomber ?
ko: 파티션을 삭제하시겠습니까?
tr: Bölüm Silinsin mi?
vi: Xoá phân vùng?
zh_hans: 删除分区？
zh_hant: 要刪除分割區嗎？

source: No matching schemas
fr: Aucun schéma correspondant
ko: 일치하는 스키마 없음
vi: Không có schema khớp
zh_hans: 无匹配 Schema
zh_hant: 無符合的綱要

source: Passwords will be encrypted with the passphrase you provide.
fr: Les mots de passe seront cryptés avec la phrase de passe que vous fournissez.
ko: 암호는 입력한 암호 구문으로 암호화됩니다.
tr: Parolalar, sağladığınız parola ile şifrelenecektir.
vi: Mật khẩu sẽ được mã hóa bằng cụm mật khẩu bạn cung cấp.
zh_hans: 密码将使用您提供的密码短语进行加密。
zh_hant: 密碼將使用你提供的通關密語加密。

source: Compared %1$@ keys in key order, up to %2$@. Filter both sides past that key for the next rows. NULL keys are not read under a limit.
fr: Compare les clés %1$@ par ordre de clé, jusqu'à %2$@. Filtre les deux côtés au-delà de cette clé pour les prochaines lignes. Les clés NULL ne sont pas lues en dessous d'une limite.

source: Backed up
fr: Sauvegardé

source: Queries
fr: Requêtes
ko: 쿼리
tr: Sorgular
vi: Truy vấn
zh_hans: 查询
zh_hant: 查詢

source: Never executed
fr: Jamais exécuté
ko: 실행한 적 없음
tr: Hiç çalıştırılmadı
vi: Chưa từng chạy
zh_hans: 从未执行
zh_hant: 從未執行

source: Whether columns were searched, or left out because the table matches reached the limit or the column read failed
fr: Que les colonnes aient été recherchées ou omises parce que la correspondance de la table a atteint la limite ou que la lecture de la colonne a échoué.

source: No matching opening bracket
fr: Pas de bracket d'ouverture correspondant
ko: 짝이 맞는 여는 괄호 없음
tr: Eşleşen açılış parantezi yok
vi: Không có dấu mở ngoặc tương ứng
zh_hans: 没有匹配的左括号
zh_hant: 沒有相符的左括號

source: Maximum number of activations reached.
fr: Nombre maximum d'activations atteint.
ko: 최대 활성화 수에 도달했습니다.
tr: Maksimum etkinleştirme sayısına ulaşıldı.
vi: Đã đạt số lượng kích hoạt tối đa.
zh_hans: 已达到最大激活数。
zh_hant: 已達到最大啟用次數。

source: Read-Write
fr: Lecture-Écriture
ko: 읽기 및 쓰기
tr: Okuma-Yazma
vi: Đọc-ghi
zh_hans: 读写
zh_hant: 讀寫

source: Verify CA and Verify Identity check the server certificate against the system trust store. This driver takes no custom CA or client certificate.
fr: Vérifier CA et Vérifier l'identité vérifie le certificat du serveur contre le magasin de confiance du système. Ce pilote ne prend pas de certificat CA ou client personnalisé.

source: '%@' is a reserved Windows device name
fr: «%@» est un nom de périphérique Windows réservé
ko: '%@' 이름은 Windows에서 예약된 장치 이름입니다
tr: '%@' ayrılmış bir Windows aygıt adıdır
vi: '%@' là tên thiết bị Windows dành riêng
zh_hans: '%@' 是 Windows 保留设备名
zh_hant: 「%@」是 Windows 保留的裝置名稱

source: Search for connection…
fr: Rechercher une connexion...
ko: 연결 검색…
tr: Bağlantı ara…
vi: Tìm kết nối…
zh_hans: 搜索连接…
zh_hant: 搜尋連線…

source: Add Another SQL Folder…
fr: Ajouter un autre dossier SQL...
ko: 다른 SQL 폴더 추가…
tr: Başka Bir SQL Klasörü Ekle…
vi: Thêm thư mục SQL khác…
zh_hans: 添加另一个 SQL 文件夹…
zh_hant: 加入另一個 SQL 資料夾…
